#Выведите первый символ.
#Выведите последний символ (используя отрицательный индекс).
#Выведите подстроку с третьего по пятый символы (то есть со второго по четвёртый индекс. Важно помнить что в записи [4:8] выведется с 4 по 7 индекс).
#Выведите строку наоборот
#Выведите длину строки (функция len).
#Соедините строки 'это новая строка' и 'это моя строка' (в той же последовательности) и выведите результат на экран.

print('это моя строка'[0])
print('это моя строка'[-1])
print('это моя строка'[2:5])
print('это моя строка'[::-1])
print(len('это моя строка'))
print('это моя строка' + 'это моя строка')
